#include <iostream>
using namespace std;
int main() {
  system("chcp 65001");
  string a ;
  string l ;
  int x;
  printf("请输入(16个字符)姓名：");
  cin>>a;
  printf("请输入(1 - 100)等级：");
  cin>>x;
  printf("请输入(男填 N 女填 L)性别：");
  cin>>l;
cout<<"\n********姓名********\n********"<<a<<"********\n********等级********\n********"<<x<<"********\n********性别********\n********"<<l<<"********\n********攻击********\n********"<<6000*x*0.8<<"********\n********防御********\n********"<<10000*x*1.2<<"********\n********血量********\n********"<<3000*x*2.1<<"********\n********蓝量********\n********"<<4000*x*3.1<<"********"<<endl;
return 0 ;
}
